Autodesk.Revit.DB.ExternalFileUtils.GetBaseForRelativePathFromDocument(Autodesk.Revit.DB.Document)
Gets the path that is the basis for relative paths from a document
Remarks:
This is the path to the central model if this is a workshared document.
Otherwise it is the path to the model file itself.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.GetFileBasedTempFolder(System.String)
Gets a temp folder based on the given file name
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012